# 我想大部分人都知道，通常一个程序员会具有的美德。当然了，有三种：懒惰、暴躁、傲慢。
# 一个人写的烂软件将会给另一个人带来一份全职工作。
# 一鼓作气，考研是一种忍耐！！！

'''
·字符串的大小写转化的操作方法
     ·upper()      把字特串中所有字符都转成大写字母
     ·lower()      把字符車中所有字符都转成小写字母
     ·swapcase()   把字符串中所有大写字母转成小可字母,把所有小写字母都转成大写字母
     ·capitalize() 只把第一个字符转换为大写，把其余字符转换为小写
     ·title()      把每个单词的第一个字符转换为大写,把每个单词的剩余字符转换为小写
     '''


s='hello,python'
print('---------------upper()把字特串中所有字符都转成大写字母----------------------')
a=s.upper()      #转成大写之后，会产生一个新的字符串对象
print(a,id(a))
print(s,id(s))
print('---------------lower()把字符車中所有字符都转成小写字母----------------------')
b=s.lower()      #虽然本身就是小写，转换之后也是小写，但是转换之后会产生一个新的字符串对象
print(b,id(b))
print(s,id(s))
print(b==s)      #True   内容相等
print(b is s)    #False  地址不相等，没有驻留


s2='Hello,Python'
print('---------------swapcase()把字符串中所有大写字母转成小可字母,把所有小写字母都转成大写字母----------------------')
print(s2.swapcase())    #hELLO,pYTHON



s3='HeLlO,hElLo'
print('---------------capitalize()把字符串中所有大写字母转成小可字母,把所有小写字母都转成大写字母----------------------')
print(s3.capitalize())



print('---------------title()把每个单词的第一个字符转换为大写,把每个单词的剩余字符转换为小写----------------------')
print(s3.title())
