# 我想大部分人都知道，通常一个程序员会具有的美德。当然了，有三种：懒惰、暴躁、傲慢。
# 一个人写的烂软件将会给另一个人带来一份全职工作。
# 一鼓作气，考研是一种忍耐！！！

print('---------------两个集合是否相等------------------')
s1={10,20,30,40}
s2={30,40,20,10}
print(s1!=s2)
print(s1==s2)   #集合的无序性，只要元素相同两个集合就相同


s1={10,20,30,40,50,60}
s2={10,20,30,40}
s3={10,20,90}
s4={100,200,300}
print('---------------一个集合是否是另一个集合的子集-----------------')   #可调用issubset进行判断
print(s2.issubset(s1))
print(s3.issubset(s1))


print('---------------一个集合是否是另一个集合的超集(全集)------------------')  #可调用issuperset进行判断
print(s1.issuperset(s2))     #Ture
print(s1.issuperset(s3))     #False


print('-------------------两个集合是否含有交集------------------')        #可调用isdisjoint进行判断
print(s2.isdisjoint(s3))        #有交集为False
print(s2.isdisjoint(s4))        #无交集为Ture

